status/2021/16jul21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>10 July 2021 - 16 July 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">10 July 2021 - 16 July 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org07211fa">1. Santa Cruz Weather Station</a>
<ul>
<li><a href="#orgfe3a88b">1.1. Next step</a>
<ul>
<li><a href="#orgb4e2a3b">1.1.1. Order any needed supplies</a></li>
<li><a href="#org6212713">1.1.2. Assemble and test</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org67281bf">2. Soap Molds</a></li>
<li><a href="#org4490221">3. Github</a></li>
<li><a href="#org27c6cb8">4. Linux Audio</a>
<ul>
<li><a href="#org07bc62c">4.1. pvanal to spectrogram</a></li>
<li><a href="#org08938a3">4.2. CSound programming.</a>
<ul>
<li><a href="#orge73f4bc">4.2.1. Next Steps</a></li>
</ul>
</li>
<li><a href="#org519d520">4.3. Faust programming</a>
<ul>
<li><a href="#orgc70efe3">4.3.1. Next Steps</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge8d2f3a">5. EPICS</a>
<ul>
<li><a href="#org5227851">5.1. Next steps</a>
<ul>
<li><a href="#org6ac149a">5.1.1. u3scpi network port testing</a></li>
<li><a href="#org8632e6d">5.1.2. initial EPICS interface</a></li>
<li><a href="#orga01e554">5.1.3. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org30626e7">6. Brini Tracker II</a>
<ul>
<li><a href="#org41235af">6.1. Next steps</a>
<ul>
<li><a href="#org3732ade">6.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#orge2e1c6d">6.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#org69e1d12">6.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org856703d">7. wktcolor</a>
<ul>
<li><a href="#orgb7ab70f">7.1. Next steps</a>
<ul>
<li><a href="#orgff918f8">7.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0baefdb">8. wktplot</a>
<ul>
<li><a href="#org8d1fdd9">8.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org6af936b">9. AMDGPU</a>
<ul>
<li><a href="#org4aac45e">9.1. Next step</a>
<ul>
<li><a href="#org9f9d777">9.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org62cb153">10. Ninja v Make</a>
<ul>
<li><a href="#org0d2c4b8">10.1. Next Step</a>
<ul>
<li><a href="#org577774b">10.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga5e5c75">11. GMP Forth</a></li>
<li><a href="#org9d8a043">12. ca-r</a>
<ul>
<li><a href="#org97f1438">12.1. Next Step</a></li>
</ul>
</li>
<li><a href="#org845f7d1">13. Swocer</a>
<ul>
<li><a href="#orgc74e1b4">13.1. Most crashing addressed</a></li>
<li><a href="#org221c28a">13.2. Added outline for 'bottle' test</a></li>
<li><a href="#org3d693f7">13.3. Next steps</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Cool summer weather
</p>

<div id="outline-container-org07211fa" class="outline-2">
<h2 id="org07211fa"><span class="section-number-2">1.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-1">
<p>
Most Particle Monitor shelter parts fabricated.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Part</th>
<th scope="col" class="org-right">Quan.</th>
<th scope="col" class="org-left">Designed?</th>
<th scope="col" class="org-left">Fabricated?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Vent connector mount</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">Vent connector cover</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">Vent mount</td>
<td class="org-right">2</td>
<td class="org-left">*</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PM box</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM lid</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM Baffle</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM Screen mount</td>
<td class="org-right">2</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM Screen holder</td>
<td class="org-right">2</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM Inlet shroud</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM box mount</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Vent/UV mount</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PM Cable assembly</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">(1)</td>
</tr>

<tr>
<td class="org-left">UV Cable assembly</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
(1) Likely will just reuse previous assembly
</p>
</div>

<div id="outline-container-orgfe3a88b" class="outline-3">
<h3 id="orgfe3a88b"><span class="section-number-3">1.1.</span> Next step</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Using hardware I have on hand.
</p>
</div>
<div id="outline-container-orgb4e2a3b" class="outline-4">
<h4 id="orgb4e2a3b"><span class="section-number-4">1.1.1.</span> Order any needed supplies</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Still need to establish a better source of hardware.
</p>
</div>
</div>

<div id="outline-container-org6212713" class="outline-4">
<h4 id="org6212713"><span class="section-number-4">1.1.2.</span> Assemble and test</h4>
</div>
</div>
</div>

<div id="outline-container-org67281bf" class="outline-2">
<h2 id="org67281bf"><span class="section-number-2">2.</span> Soap Molds</h2>
<div class="outline-text-2" id="text-2">
<p>
Tried prototype mold (without drafts) based on C++ bottle demo. Printed.
</p>
</div>
</div>
<div id="outline-container-org4490221" class="outline-2">
<h2 id="org4490221"><span class="section-number-2">3.</span> Github</h2>
<div class="outline-text-2" id="text-3">
<p>
Added build actions to gmpforth, xrso12832, wktplot, libriffr and
libpvocf.  wktcolor needs more build fiddling as Ubuntu doesn't have
packages for ColPack or OpenMesh AFAICT.
</p>
</div>
</div>
<div id="outline-container-org27c6cb8" class="outline-2">
<h2 id="org27c6cb8"><span class="section-number-2">4.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org07bc62c" class="outline-3">
<h3 id="org07bc62c"><span class="section-number-3">4.1.</span> pvanal to spectrogram</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Started. Much to my surprise, existing audio file libraries
(libsnd, audiofile) cannot read the extended WAV format used by
CSound.  To that end, started libriffr
<a href="https://github.com/daniel-kelley/libriffr">https://github.com/daniel-kelley/libriffr</a> for the RIFF file parsing
and libpvocf <a href="https://github.com/daniel-kelley/libpvocf">https://github.com/daniel-kelley/libpvocf</a> for the PVOC
specific handling.
</p>
</div>
</div>

<div id="outline-container-org08938a3" class="outline-3">
<h3 id="org08938a3"><span class="section-number-3">4.2.</span> CSound programming.</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The FORTRAN of computer music. Getting up to speed.
</p>
</div>
<div id="outline-container-orge73f4bc" class="outline-4">
<h4 id="orge73f4bc"><span class="section-number-4">4.2.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-4-2-1">
</div>
<ol class="org-ol">
<li><a id="orga35501b"></a>loscil demo<br /></li>
<li><a id="org4b97161"></a>spectrogram loop point analysis<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org519d520" class="outline-3">
<h3 id="org519d520"><span class="section-number-3">4.3.</span> Faust programming</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-orgc70efe3" class="outline-4">
<h4 id="orgc70efe3"><span class="section-number-4">4.3.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-4-3-1">
</div>
<ol class="org-ol">
<li><a id="orgfe6afe4"></a>GAC Patch save/restore<br /></li>
<li><a id="org3ede451"></a>LV2 autopatcher<br />
<div class="outline-text-5" id="text-4-3-1-2">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</li>
<li><a id="orgab7c7b8"></a>OSC control surface<br />
<div class="outline-text-5" id="text-4-3-1-3">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</li>
<li><a id="orga27c794"></a>Faust/csound<br />
<div class="outline-text-5" id="text-4-3-1-4">
<p>
See if a faust generated unit works.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orge8d2f3a" class="outline-2">
<h2 id="orge8d2f3a"><span class="section-number-2">5.</span> EPICS</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org5227851" class="outline-3">
<h3 id="org5227851"><span class="section-number-3">5.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org6ac149a" class="outline-4">
<h4 id="org6ac149a"><span class="section-number-4">5.1.1.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-org8632e6d" class="outline-4">
<h4 id="org8632e6d"><span class="section-number-4">5.1.2.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-orga01e554" class="outline-4">
<h4 id="orga01e554"><span class="section-number-4">5.1.3.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>

<div id="outline-container-org30626e7" class="outline-2">
<h2 id="org30626e7"><span class="section-number-2">6.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-6">
<p>
Suspended for now.
</p>
</div>
<div id="outline-container-org41235af" class="outline-3">
<h3 id="org41235af"><span class="section-number-3">6.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org3732ade" class="outline-4">
<h4 id="org3732ade"><span class="section-number-4">6.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-orge2e1c6d" class="outline-4">
<h4 id="orge2e1c6d"><span class="section-number-4">6.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-org69e1d12" class="outline-4">
<h4 id="org69e1d12"><span class="section-number-4">6.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-org856703d" class="outline-2">
<h2 id="org856703d"><span class="section-number-2">7.</span> wktcolor</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgb7ab70f" class="outline-3">
<h3 id="orgb7ab70f"><span class="section-number-3">7.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-orgff918f8" class="outline-4">
<h4 id="orgff918f8"><span class="section-number-4">7.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org0baefdb" class="outline-2">
<h2 id="org0baefdb"><span class="section-number-2">8.</span> wktplot</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org8d1fdd9" class="outline-3">
<h3 id="org8d1fdd9"><span class="section-number-3">8.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
Explore biological cell Voronoi organization
</p>
</div>
</div>
</div>

<div id="outline-container-org6af936b" class="outline-2">
<h2 id="org6af936b"><span class="section-number-2">9.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org4aac45e" class="outline-3">
<h3 id="org4aac45e"><span class="section-number-3">9.1.</span> Next step</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org9f9d777" class="outline-4">
<h4 id="org9f9d777"><span class="section-number-4">9.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-org62cb153" class="outline-2">
<h2 id="org62cb153"><span class="section-number-2">10.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org0d2c4b8" class="outline-3">
<h3 id="org0d2c4b8"><span class="section-number-3">10.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-10-1">
</div>
<div id="outline-container-org577774b" class="outline-4">
<h4 id="org577774b"><span class="section-number-4">10.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-orga5e5c75" class="outline-2">
<h2 id="orga5e5c75"><span class="section-number-2">11.</span> GMP Forth</h2>
<div class="outline-text-2" id="text-11">
<p>
Need to think about adding floating point support
</p>
</div>
</div>

<div id="outline-container-org9d8a043" class="outline-2">
<h2 id="org9d8a043"><span class="section-number-2">12.</span> ca-r</h2>
<div class="outline-text-2" id="text-12">
<p>
Tier data finally deprecated so processing is removed.
</p>
</div>
<div id="outline-container-org97f1438" class="outline-3">
<h3 id="org97f1438"><span class="section-number-3">12.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-12-1">
<p>
None.
</p>
</div>
</div>
</div>
<div id="outline-container-org845f7d1" class="outline-2">
<h2 id="org845f7d1"><span class="section-number-2">13.</span> Swocer</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orgc74e1b4" class="outline-3">
<h3 id="orgc74e1b4"><span class="section-number-3">13.1.</span> Most crashing addressed</h3>
<div class="outline-text-3" id="text-13-1">
<p>
Nullified 'handle' API free functions helped a lot.
Still see some errors in operations.
</p>
</div>
</div>
<div id="outline-container-org221c28a" class="outline-3">
<h3 id="org221c28a"><span class="section-number-3">13.2.</span> Added outline for 'bottle' test</h3>
<div class="outline-text-3" id="text-13-2">
<p>
Added all functions believed to be needed for 'bottle' demo test.
Test doesn't pass so is disabled.
</p>
</div>
</div>
<div id="outline-container-org3d693f7" class="outline-3">
<h3 id="org3d693f7"><span class="section-number-3">13.3.</span> Next steps</h3>
<div class="outline-text-3" id="text-13-3">
<p>
Swocer future.
Check out what's needed for gears.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>